
{
  "title":"Lecture 7",
  "content":" Black Box and Glass Box Testing With the below implementation, is the test set \u0026ldquo;n = 4 | n = -4 | n = 5\u0026rdquo; path complete?\ndef is_even(n):\r\u0026#34;\u0026#34;\u0026#34; Returns True if a number is even\rand False if not \u0026#34;\u0026#34;\u0026#34;\rif n \u0026gt; 0 and n % 2 == 0:\rreturn True\relif n \u0026lt; 0 and n % 2 == 0:\rreturn True\relse: return False \u0026nbsp;Yes\u0026nbsp; check \u0026nbsp;No\u0026nbsp; close Check With the above implementation, which value for n is incorrectly labeled by is_even?\n\u0026nbsp;n is very large (and positive)\u0026nbsp; close \u0026nbsp; n is very small (and negative)\u0026nbsp; close \u0026nbsp;n is 0\u0026nbsp; check Check \u0026emsp; Show Solution View video page Download video Download transcript Errors Below is a piece of code and an error shown when running it. What is the problem?\nL = 3\rfor i in range(len(L)):\rprint(i)\rERROR MESSAGE:\rFile \u0026#34;C:/Users/Ana/.spyder2-py3/temp.py\u0026#34;, line 2, in for i in range(len(L)):\rTypeError: object of type \u0026#39;int\u0026#39; has no len() \u0026nbsp;You are not allowed to name an integer with the variable name L\u0026nbsp; close \u0026nbsp;range is not allowed to have an expression inside its parentheses\u0026nbsp; close \u0026nbsp;You are not allowed to call len on an integer\u0026nbsp; check \u0026nbsp;You are not allowed to print the loop variable i\u0026nbsp; close Check \u0026emsp; Show Solution View video page Download video Download transcript Exceptions If the user enters \u0026ldquo;twenty\u0026rdquo; in the code below what does the program do?\ntry:\rn = int(input(\u0026#34;How old are you? \u0026#34;))\rpercent = round(n*100/80, 1)\rprint(\u0026#34;You\u0026#39;ve gone through\u0026#34;, percent, \u0026#34;% of your life!\u0026#34;)\rexcept ValueError:\rprint(\u0026#34;Oops, must enter a number.\u0026#34;)\rexcept ZeroDivisionError:\rprint(\u0026#34;Division by zero.\u0026#34;)\rexcept:\rprint(\u0026#34;Something went very wrong.\u0026#34;) \u0026nbsp;prints \"You've gone through 25.0 % of your life!\"\u0026nbsp; close \u0026nbsp;prints \"Oops, must enter a number.\"\u0026nbsp; check Check If the user enters \u0026ldquo;0\u0026rdquo; in the code above what does the program do?\n\u0026nbsp;prints \"You've gone through 0.0 % of your life!\"\u0026nbsp; check \u0026nbsp;prints \"Division by zero.\"\u0026nbsp; close Check \u0026emsp; Show Solution View video page Download video Download transcript "}


